'use client';

import React from 'react';
import block from 'bem-cn-lite';
import './InfrastructureChoose.scss';

const b = block('infrastructure-choose');

interface TabItem {
    value: string;
    label: string;
}

interface ListItem {
    icon: React.ReactNode;
    text: string;
}

const tabs: TabItem[] = [
    {value: 'scale', label: 'Масштабирование\nбез ограничений'},
    {value: 'ai', label: 'Инфраструктура\nдля ИИ'},
    {value: 'stability', label: 'Стабильная работа\nсервисов'},
    {value: 'ttm', label: 'Ускорение\ntime-to-market'},
];

const listItems: ListItem[] = [
    {
        icon: (
            <svg
                width="38"
                height="16"
                viewBox="0 0 38 16"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
            >
                <path
                    d="M8.09471 9.32317V9.82317H8.59471V9.32317H8.09471ZM8.09471 0.5V0H7.59471V0.5H8.09471ZM15.1709 0.5H15.6709V0H15.1709V0.5ZM15.1709 14.6525H14.6709V15.1525H15.1709V14.6525ZM22.2472 14.6525V15.1525H22.7472V14.6525H22.2472ZM22.2472 0.5V0H21.7472V0.5H22.2472ZM29.3234 0.5H29.8234V0H29.3234V0.5ZM0.001302 9.32317C0.001302 10.7959 1.19521 11.9898 2.66797 11.9898C4.14073 11.9898 5.33464 10.7959 5.33464 9.32317C5.33464 7.85041 4.14073 6.65651 2.66797 6.65651C1.19521 6.65651 0.001302 7.85041 0.001302 9.32317ZM32.0013 9.32317C32.0013 10.7959 33.1952 11.9898 34.668 11.9898C36.1407 11.9898 37.3346 10.7959 37.3346 9.32317C37.3346 7.85041 36.1407 6.65651 34.668 6.65651C33.1952 6.65651 32.0013 7.85041 32.0013 9.32317ZM29.3234 9.32317H28.8234V9.82317H29.3234V9.32317ZM8.09471 9.32317H8.59471V0.5H8.09471H7.59471V9.32317H8.09471ZM8.09471 0.5V1H15.1709V0.5V0H8.09471V0.5ZM15.1709 0.5H14.6709V14.6525H15.1709H15.6709V0.5H15.1709ZM15.1709 14.6525V15.1525H22.2472V14.6525V14.1525H15.1709V14.6525ZM22.2472 14.6525H22.7472V0.5H22.2472H21.7472V14.6525H22.2472ZM22.2472 0.5V1H29.3234V0.5V0H22.2472V0.5ZM8.09471 9.32317V8.82317H2.66797V9.32317V9.82317H8.09471V9.32317ZM29.3234 0.5H28.8234V9.32317H29.3234H29.8234V0.5H29.3234ZM34.668 9.32317V8.82317H29.3234V9.32317V9.82317H34.668V9.32317Z"
                    fill="black"
                />
            </svg>
        ),
        text: 'Сетевая\nсвязность',
    },
    {
        icon: (
            <svg
                width="38"
                height="16"
                viewBox="0 0 38 16"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
            >
                <path
                    d="M8.09471 9.32317V9.82317H8.59471V9.32317H8.09471ZM0.001302 9.32317C0.001302 10.7959 1.19521 11.9898 2.66797 11.9898C4.14073 11.9898 5.33464 10.7959 5.33464 9.32317C5.33464 7.85041 4.14073 6.65651 2.66797 6.65651C1.19521 6.65651 0.001302 7.85041 0.001302 9.32317ZM32.0013 9.32317C32.0013 10.7959 33.1952 11.9898 34.668 11.9898C36.1407 11.9898 37.3346 10.7959 37.3346 9.32317C37.3346 7.85041 36.1407 6.65651 34.668 6.65651C33.1952 6.65651 32.0013 7.85041 32.0013 9.32317ZM29.3234 9.32317H28.8234V9.82317H29.3234V9.32317ZM8.09471 9.32317H8.59471V4.03811H8.09471H7.59471V9.32317H8.09471ZM15.1709 4.03811H14.6709V11.1143H15.1709H15.6709V4.03811H15.1709ZM22.2472 11.1143H22.7472V4.03811H22.2472H21.7472V11.1143H22.2472ZM8.09471 9.32317V8.82317H2.66797V9.32317V9.82317H8.09471V9.32317ZM29.3234 4.03811H28.8234V9.32317H29.3234H29.8234V4.03811H29.3234ZM34.668 9.32317V8.82317H29.3234V9.32317V9.82317H34.668V9.32317ZM25.7853 0.5V1C27.4632 1 28.8234 2.36021 28.8234 4.03811H29.3234H29.8234C29.8234 1.80792 28.0155 0 25.7853 0V0.5ZM22.2472 4.03811H22.7472C22.7472 2.36021 24.1074 1 25.7853 1V0.5V0C23.5551 0 21.7472 1.80792 21.7472 4.03811H22.2472ZM18.7091 14.6525V15.1525C20.9392 15.1525 22.7472 13.3445 22.7472 11.1143H22.2472H21.7472C21.7472 12.7922 20.387 14.1525 18.7091 14.1525V14.6525ZM15.1709 11.1143H14.6709C14.6709 13.3445 16.4789 15.1525 18.7091 15.1525V14.6525V14.1525C17.0311 14.1525 15.6709 12.7922 15.6709 11.1143H15.1709ZM11.6328 0.5V1C13.3107 1 14.6709 2.36021 14.6709 4.03811H15.1709H15.6709C15.6709 1.80793 13.863 0 11.6328 0V0.5ZM8.09471 4.03811H8.59471C8.59471 2.36021 9.95492 1 11.6328 1V0.5V0C9.40263 0 7.59471 1.80792 7.59471 4.03811H8.09471Z"
                    fill="black"
                />
            </svg>
        ),
        text: 'VPS PE',
    },
    {
        icon: (
            <svg
                width="32"
                height="7"
                viewBox="0 0 32 7"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
            >
                <rect
                    x="2.36803"
                    y="1.28125"
                    width="1.28198"
                    height="1.27771"
                    rx="0.638856"
                    transform="rotate(-90 2.36803 1.28125)"
                    fill="#B0BDD9"
                />
                <path d="M3.00865 3.23828L28.5629 3.23828" stroke="black" />
                <rect
                    x="26.9376"
                    y="4.86014"
                    width="3.24659"
                    height="3.22503"
                    rx="1.61251"
                    transform="rotate(-90 26.9376 4.86014)"
                    fill="black"
                    stroke="black"
                    strokeWidth="3.22503"
                />
                <rect
                    x="1.50084"
                    y="4.7461"
                    width="3"
                    height="3"
                    rx="1.5"
                    transform="rotate(-90 1.50084 4.7461)"
                    fill="black"
                    stroke="black"
                    strokeWidth="3"
                />
            </svg>
        ),
        text: 'Cloud\ninterconnect',
    },
    {
        icon: (
            <svg
                width="38"
                height="6"
                viewBox="0 0 38 6"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
            >
                <path
                    d="M37.3346 2.66797C37.3346 1.19521 36.1407 0.00130207 34.668 0.001302C33.1952 0.00130194 32.0013 1.19521 32.0013 2.66797C32.0013 4.14073 33.1952 5.33464 34.668 5.33464C36.1407 5.33464 37.3346 4.14073 37.3346 2.66797ZM5.33464 2.66797C5.33464 1.19521 4.14073 0.00130067 2.66797 0.00130061C1.19521 0.00130054 0.00130088 1.19521 0.00130081 2.66797C0.00130075 4.14073 1.19521 5.33463 2.66797 5.33463C4.14073 5.33463 5.33464 4.14073 5.33464 2.66797ZM32.668 2.16797C32.3918 2.16797 32.168 2.39183 32.168 2.66797C32.168 2.94411 32.3918 3.16797 32.668 3.16797L32.668 2.66797L32.668 2.16797ZM28.668 3.16797C28.9441 3.16797 29.168 2.94411 29.168 2.66797C29.168 2.39183 28.9441 2.16797 28.668 2.16797L28.668 2.66797L28.668 3.16797ZM24.668 2.16797C24.3918 2.16797 24.168 2.39183 24.168 2.66797C24.168 2.94411 24.3918 3.16797 24.668 3.16797L24.668 2.66797L24.668 2.16797ZM20.668 3.16797C20.9441 3.16797 21.168 2.94411 21.168 2.66797C21.168 2.39183 20.9441 2.16797 20.668 2.16797L20.668 2.66797L20.668 3.16797ZM16.668 2.16797C16.3918 2.16797 16.168 2.39183 16.168 2.66797C16.168 2.94411 16.3918 3.16797 16.668 3.16797L16.668 2.66797L16.668 2.16797ZM12.668 3.16797C12.9441 3.16797 13.168 2.94411 13.168 2.66797C13.168 2.39183 12.9441 2.16797 12.668 2.16797L12.668 2.66797L12.668 3.16797ZM8.66797 2.16797C8.39183 2.16797 8.16797 2.39183 8.16797 2.66797C8.16797 2.94411 8.39183 3.16797 8.66797 3.16797L8.66797 2.66797L8.66797 2.16797ZM4.66797 3.16797C4.94411 3.16797 5.16797 2.94411 5.16797 2.66797C5.16797 2.39183 4.94411 2.16797 4.66797 2.16797L4.66797 2.66797L4.66797 3.16797ZM34.668 2.66797L34.668 2.16797L32.668 2.16797L32.668 2.66797L32.668 3.16797L34.668 3.16797L34.668 2.66797ZM28.668 2.66797L28.668 2.16797L24.668 2.16797L24.668 2.66797L24.668 3.16797L28.668 3.16797L28.668 2.66797ZM20.668 2.66797L20.668 2.16797L16.668 2.16797L16.668 2.66797L16.668 3.16797L20.668 3.16797L20.668 2.66797ZM12.668 2.66797L12.668 2.16797L8.66797 2.16797L8.66797 2.66797L8.66797 3.16797L12.668 3.16797L12.668 2.66797ZM4.66797 2.66797L4.66797 2.16797L2.66797 2.16797L2.66797 2.66797L2.66797 3.16797L4.66797 3.16797L4.66797 2.66797Z"
                    fill="black"
                />
            </svg>
        ),
        text: 'VPS',
    },
    {
        icon: (
            <svg
                width="32"
                height="19"
                viewBox="0 0 32 19"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
            >
                <rect
                    x="2.36803"
                    y="13.793"
                    width="1.28198"
                    height="1.27771"
                    rx="0.638856"
                    transform="rotate(-90 2.36803 13.793)"
                    fill="#B0BDD9"
                />
                <path
                    d="M28.5629 13.3198C28.5629 6.23964 22.8424 0.5 15.7858 0.5C8.72916 0.5 3.00865 6.23964 3.00865 13.3198"
                    stroke="black"
                />
                <rect
                    x="26.9415"
                    y="17.368"
                    width="3.24659"
                    height="3.22503"
                    rx="1.61251"
                    transform="rotate(-90 26.9415 17.368)"
                    fill="black"
                    stroke="black"
                    strokeWidth="3.22503"
                />
                <rect
                    x="1.50084"
                    y="17.2539"
                    width="3"
                    height="3"
                    rx="1.5"
                    transform="rotate(-90 1.50084 17.2539)"
                    fill="black"
                    stroke="black"
                    strokeWidth="3"
                />
            </svg>
        ),
        text: 'Cloud Router',
    },
];

export const InfrastructureChoose: React.FC = () => {
    const [activeTab, setActiveTab] = React.useState(tabs[0].value);

    const renderContent = () => {
        switch (activeTab) {
            case 'scale':
                return <h3>Масштабирование без ограничений</h3>;
            case 'ai':
                return <h3>Инфраструктура для ИИ</h3>;
            case 'stability':
                return <h3>Стабильная работа сервисов</h3>;
            case 'ttm':
                return <h3>Ускорение time-to-market</h3>;
            default:
                return null;
        }
    };

    return (
        <div className={b()}>
            <div className={b('content')}>
                <div className={b('content-inner')}>{renderContent()}</div>
            </div>

            <div className={b('sidebar')}>
                <h2 className={b('title')}>Выбери инфраструктуру:</h2>
                <div className={b('tabs')}>
                    {tabs.map((tab) => (
                        <button
                            key={tab.value}
                            type="button"
                            className={b('tab', {active: activeTab === tab.value})}
                            onClick={() => setActiveTab(tab.value)}
                        >
                            {tab.label}
                        </button>
                    ))}
                </div>
                <hr className={b('divider')} />

                <button className={b('architect-button')} type="button">
                    <span className={b('architect-button-text')}>Комментарии архитектора</span>
                    <svg
                        className={b('architect-button-arrow')}
                        width="9"
                        height="16"
                        viewBox="0 0 9 16"
                        fill="none"
                        xmlns="http://www.w3.org/2000/svg"
                    >
                        <path
                            fillRule="evenodd"
                            clipRule="evenodd"
                            d="M0.329505 15.4205C-0.109835 14.9812 -0.109835 14.2688 0.329505 13.8295L6.28401 7.875L0.329504 1.9205C-0.109836 1.48116 -0.109836 0.768849 0.329504 0.32951C0.768844 -0.10983 1.48115 -0.10983 1.92049 0.32951L8.67049 7.07951C9.10983 7.51885 9.10983 8.23116 8.67049 8.6705L1.92049 15.4205C1.48115 15.8598 0.768844 15.8598 0.329505 15.4205Z"
                            fill="white"
                            fillOpacity="0.7"
                        />
                    </svg>
                </button>

                <hr className={b('divider')} />

                <h3 className={b('section-title')}>Легенда</h3>

                <div className={b('buttons')}>
                    {listItems.map((item, index) => (
                        <button key={index} type="button" className={b('button')}>
                            <div className={b('button-icon')}>{item.icon}</div>
                            <span className={b('button-text')}>{item.text}</span>
                        </button>
                    ))}
                </div>

                <div className={b('hint')}>
                    <svg
                        width="17"
                        height="17"
                        viewBox="0 0 17 17"
                        fill="none"
                        xmlns="http://www.w3.org/2000/svg"
                    >
                        <g clipPath="url(#clip0_386_46687)">
                            <path
                                d="M9.21244 0.527343L16.4688 0.527344L16.4687 7.78365M16.4688 0.527344L9.21244 7.78365"
                                stroke="black"
                                strokeLinecap="round"
                            />
                            <path
                                d="M7.78756 16.4727L0.53125 16.4727L0.531251 9.21635M0.53125 16.4727L6.43276 10.5712L7.78756 9.21635"
                                stroke="black"
                                strokeLinecap="round"
                            />
                        </g>
                        <defs>
                            <clipPath id="clip0_386_46687">
                                <rect width="17" height="17" fill="white" />
                            </clipPath>
                        </defs>
                    </svg>
                    <span>Увеличивай чтобы рассмотреть</span>
                </div>
            </div>
        </div>
    );
};
